Revit 2027 API
BuiltInFailures.WallFailures.ConstrainedToWallError Property
 Sketch Lines created with Pick Wall must remain parallel to the Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConstrainedToWallError { get; }
Public Shared ReadOnly Property ConstrainedToWallError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConstrainedToWallError {
	FailureDefinitionId^ get ();
}
static member ConstrainedToWallError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace